#ifndef _CHARACTERTWEAKS_H_
#define _CHARACTERTWEAKS_H_

#include "TweaksBase.h"

class PlayerTweaks : public TweaksBase
{
public:
    PlayerTweaks(const char* name) : TweaksBase(name) { Init(); }  // Inline constructor
    virtual ~PlayerTweaks();
    virtual void Init();

    /* 0x24 */ float m_unk_0x24; // Jog Speed
    /* 0x28 */ float m_unk_0x28; // Running Speed
    /* 0x2C */ float m_unk_0x2C; // Running Turn Speed
    /* 0x30 */ float m_unk_0x30; 
    /* 0x34 */ float m_unk_0x34; // Pass Ground Speed Max
    /* 0x38 */ float m_unk_0x38; // Pass Ground Speed Min
    /* 0x3C */ float m_unk_0x3C; // Pass Volley Speed Max
    /* 0x40 */ float m_unk_0x40; // Pass Volley Speed Min
    /* 0x44 */ float m_unk_0x44; // Capsule Height
    /* 0x48 */ float m_unk_0x48; // Capsule Width
};

class GoalieTweaks : public PlayerTweaks
{
public:
    GoalieTweaks(const char*);
    virtual ~GoalieTweaks();
    virtual void Init();

    /* 0x04C */ f32 m_unk_0x4C;
    /* 0x050 */ f32 m_unk_0x50;
    /* 0x054 */ f32 m_unk_0x54;
    /* 0x058 */ f32 m_unk_0x58;
    /* 0x05C */ f32 m_unk_0x5C;
    /* 0x060 */ f32 m_unk_0x60;
    /* 0x064 */ f32 m_unk_0x64;
    /* 0x068 */ f32 m_unk_0x68;
    /* 0x06C */ f32 m_unk_0x6C;
    /* 0x070 */ f32 m_unk_0x70;
    /* 0x074 */ f32 m_unk_0x74;
    /* 0x078 */ f32 m_unk_0x78;
    /* 0x07C */ f32 m_unk_0x7C;
    /* 0x080 */ f32 m_unk_0x80;
    /* 0x084 */ f32 m_unk_0x84;
    /* 0x088 */ f32 m_unk_0x88;
    /* 0x08C */ f32 m_unk_0x8C;
    /* 0x090 */ f32 m_unk_0x90;
    /* 0x094 */ f32 m_unk_0x94;
    /* 0x098 */ f32 m_unk_0x98;
    /* 0x09C */ f32 m_unk_0x9C;
    /* 0x0A0 */ f32 m_unk_0xA0;
    /* 0x0A4 */ f32 m_unk_0xA4;
    /* 0x0A8 */ f32 m_unk_0xA8;
    /* 0x0AC */ f32 m_unk_0xAC;
    /* 0x0B0 */ f32 m_unk_0xB0;
    /* 0x0B4 */ f32 m_unk_0xB4;
    /* 0x0B8 */ f32 m_unk_0xB8;
    /* 0x0BC */ f32 m_unk_0xBC;
    /* 0x0C0 */ f32 m_unk_0xC0;
    /* 0x0C4 */ f32 m_unk_0xC4;
    /* 0x0C8 */ f32 m_unk_0xC8;
    /* 0x0CC */ f32 m_unk_0xCC;
    /* 0x0D0 */ f32 m_unk_0xD0;
    /* 0x0D4 */ f32 m_unk_0xD4;
    /* 0x0D8 */ f32 m_unk_0xD8;
    /* 0x0DC */ f32 m_unk_0xDC;
    /* 0x0E0 */ f32 m_unk_0xE0;
    /* 0x0E4 */ f32 m_unk_0xE4;
    /* 0x0E8 */ f32 m_unk_0xE8;
    /* 0x0EC */ f32 m_unk_0xEC;
    /* 0x0F0 */ f32 m_unk_0xF0;
    /* 0x0F4 */ f32 m_unk_0xF4;
    /* 0x0F8 */ f32 m_unk_0xF8;
    /* 0x0FC */ f32 m_unk_0xFC;
    /* 0x100 */ s32 m_unk_0x100;
    /* 0x104 */ s32 m_unk_0x104;
    /* 0x108 */ s32 m_unk_0x108;
    /* 0x10C */ s32 m_unk_0x10C;
    /* 0x110 */ s32 m_unk_0x110;
    /* 0x114 */ s32 m_unk_0x114;
    /* 0x118 */ s32 m_unk_0x118;
    /* 0x11C */ f32 m_unk_0x11C;
    /* 0x120 */ f32 m_unk_0x120;
};

class FielderTweaks : public PlayerTweaks
{
public:
    FielderTweaks(const char*);
    virtual ~FielderTweaks();
    virtual void Init();

    /* 0x4C */ float m_unk_0x4C;
    /* 0x50 */ float m_unk_0x50;
    /* 0x54 */ float m_unk_0x54;
    /* 0x58 */ float m_unk_0x58;
    /* 0x5C */ float m_unk_0x5C;
    /* 0x60 */ float m_unk_0x60;
    /* 0x64 */ float m_unk_0x64;
    /* 0x68 */ float m_unk_0x68;
    /* 0x6C */ float m_unk_0x6C;
    /* 0x70 */ float m_unk_0x70;
    /* 0x74 */ float m_unk_0x74;
    /* 0x78 */ float m_unk_0x78;
    /* 0x7C */ float m_unk_0x7C;
    /* 0x80 */ float m_unk_0x80;
    /* 0x84 */ float m_unk_0x84;
    /* 0x88 */ float m_unk_0x88;
    /* 0x8C */ float m_unk_0x8C;
    /* 0x90 */ float m_unk_0x90;
    /* 0x94 */ float m_unk_0x94;
    /* 0x98 */ float m_unk_0x98;
    /* 0x9C */ float m_unk_0x9C;
    /* 0xA0 */ float m_unk_0xA0;
    /* 0xA4 */ float m_unk_0xA4;
    /* 0xA8 */ float m_unk_0xA8;
    /* 0xAC */ float m_unk_0xAC;
    /* 0xB0 */ float m_unk_0xB0;
    /* 0xB4 */ float m_unk_0xB4;
    /* 0xB8 */ float m_unk_0xB8;
    /* 0xBC */ float m_unk_0xBC;
    /* 0xC0 */ float m_unk_0xC0;
    /* 0xC4 */ float m_unk_0xC4;
    /* 0xC8 */ float m_unk_0xC8;
    /* 0xCC */ float m_unk_0xCC;
    /* 0xD0 */ float m_unk_0xD0;
    /* 0xD4 */ float m_unk_0xD4;
    /* 0xD8 */ float m_unk_0xD8;
    /* 0xDC */ float m_unk_0xDC;

    /* 0xE0 */ float m_unk_0xE0;
    /* 0xE4 */ float m_unk_0xE4;
    /* 0xE8 */ float m_unk_0xE8;
    /* 0xEC */ float m_unk_0xEC;
    /* 0xF0 */ float m_unk_0xF0;
    /* 0xF4 */ float m_unk_0xF4;
    /* 0xF8 */ float m_unk_0xF8;
    /* 0xFC */ float m_unk_0xFC;

    /* 0x100 */ s32 m_unk_0x100;
    /* 0x104 */ s32 m_unk_0x104;
    /* 0x108 */ s32 m_unk_0x108;
    /* 0x10C */ s32 m_unk_0x10C;
    /* 0x110 */ s32 m_unk_0x110;
    /* 0x114 */ s32 m_unk_0x114;
    /* 0x118 */ s32 m_unk_0x118;

    /* 0x11C */ float m_unk_0x11C;
    /* 0x120 */ float m_unk_0x120;
};

#endif // _CHARACTERTWEAKS_H_
